#შექმენით ცვლადი რომელსაც კონსოლიდან მიანიჭებთ მნიშვნელობას, დაწერეთ სკრიპტი (კოდი, ლოგიკა) რომელიც ამოიღებს ამ მნიშვნელობიდან შუა წევრებს #მაგალითად:
#x ცვლადის მნიშვნელობა თუ იქნება "mac" (კენტი რაოდენობის ტექსტი) ამოიღებს "a" - ს, ხოლო თუ ცვლადის მნიშვნელობა იქნება "book" (ლუწი #რაოდენობის ტექსტი) ამოიღებს "oo" ს.
#გამოიყენეთ ჩაშენებული ფუნქცია len(ცვლადის სახელი) რომელიც ითვლის გადაცემული ცვლადის მნიშვნელობის სიგრძეს.
#
#:> Solution: 
x = input("ufantazio var da rame sityva shemoitanet tu sheidzleba: ")
if len(x)%2 == 1:
 y = (len(x)+1)/2-1
 print(x[int(y)])
if len(x)%2 == 0:
 z = (len(x)+1)/2-1
 z1 = (len(x)+1)/2
 print(x[int(z)]+x[int(z1)])